tests/load/sample_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.2">
    <hashTree>
        <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Example Test Plan"
            enabled="true">
            <stringProp name="TestPlan.comments">Product-service load test.</stringProp>
            <boolProp name="TestPlan.functional_mode">false</boolProp>
            <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
            <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"
                guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables"
                enabled="true">
                <collectionProp name="Arguments.arguments" />
            </elementProp>
        </TestPlan>
        <hashTree>
            <!-- Thread Group -->
            <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                testname="Example Thread Group" enabled="true">
                <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
                <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                    guiclass="LoopControlPanel" testclass="LoopController"
                    testname="Loop Controller" enabled="true">
                    <boolProp name="LoopController.continue_forever">false</boolProp>
                    <intProp name="LoopController.loops">1</intProp>
                </elementProp>
                <stringProp name="ThreadGroup.num_threads">10</stringProp>
                <stringProp name="ThreadGroup.ramp_time">1</stringProp>
                <boolProp name="ThreadGroup.scheduler">false</boolProp>
            </ThreadGroup>
            <hashTree>
                <!-- HTTP Request -->
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="Example HTTP Request" enabled="true">
                    <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                        guiclass="HTTPArgumentsPanel" testclass="Arguments"
                        testname="User Defined Variables" enabled="true">
                        <collectionProp name="Arguments.arguments" />
                    </elementProp>
                    <stringProp name="HTTPSampler.domain">example.com</stringProp>
                    <stringProp name="HTTPSampler.protocol">https</stringProp>
                    <stringProp name="HTTPSampler.path">/api/endpoint</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
                    <boolProp name="HTTPSampler.monitor">false</boolProp>
                </HTTPSamplerProxy>
                <!-- HTTP Request -->
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="Get all products" enabled="true">
                    <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                        guiclass="HTTPArgumentsPanel" testclass="Arguments"
                        testname="User Defined Variables" enabled="true">
                        <collectionProp name="Arguments.arguments" />
                    </elementProp>
                    <stringProp name="HTTPSampler.domain">product-service</stringProp>
                    <stringProp name="HTTPSampler.port">80</stringProp>
                    <stringProp name="HTTPSampler.protocol">http</stringProp>
                    <stringProp name="HTTPSampler.path">/api/products</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                    <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                    <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
                    <boolProp name="HTTPSampler.monitor">false</boolProp>
                </HTTPSamplerProxy>
                <hashTree />
            </hashTree>
        </hashTree>
    </hashTree>
</jmeterTestPlan>